{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"title":"App's Features","subTitle":"List of features that might help you be more productive and effective.","featureList":[{"icon":"copy","heading":"Always On Top","description":"If enabled, the app will always on top of other apps running on user's Operating System."},{"icon":"laptop","heading":"Full Screen Breaks","description":"If enabled, the app will interrupt the user by occupying the whole screen so that the user will be force to take a break."},{"icon":"alert","heading":"Strict Mode","description":"If enabled, the app will strictly follow user's configuration and prevent the user from resetting, pausing and skipping the timer when it has started."},{"icon":"moon-outline","heading":"Dark Theme","description":"Allowing the user to use Dark Mode to reduce eye strain and improves visibility for user with low vision and those who are sensitive to bright light."},{"icon":"browser","heading":"Toggle Native Titlebar","description":"Allowing the user to switch between default custom titlebar to a native one and vice versa. This feature is useful for some users especially to those who don't like the default custom titlebar."},{"icon":"timer","heading":"Timer Animation","description":"Allowing the user to disable timer progress animation to reduce the CPU usage to the app least required. It is really useful for some people."},{"icon":"notification","heading":"Desktop Notification","description":"If enabled, the app will allow the user to be notified from time to time. Notification property is divided into 3 types NONE, NORMAL and EXTRA."},{"icon":"food","heading":"Special Breaks","description":"If enabled, the user will be allowed to set some special time when the user really need to take a break."},{"icon":"repeat","heading":"Auto-Start Work Time","description":"If enabled, the app will automatically start after the timer ends. It is useful when the user did not want to always start the timer manually from time to time."},{"icon":"remove","heading":"Minimize to Tray","description":"If enabled, clicking the minimize button will not minimize the app. It will be hidden and being send to Tray instead of minimizing on the Taskbar."},{"icon":"exit","heading":"Close to Tray","description":"If enabled, clicking the close button will not quit the app. It will be hidden and being send to Tray instead of closing and quitting the app."},{"icon":"ellipse","heading":"Progress on Tray","description":"The app will show progress animation on tray. This feature can be activate if Minimize to Tray of Close to Tray is enabled. Useful when the timer is being hidden."},{"icon":"keypad","heading":"Keyboard Shortcuts","description":"Provide some useful keyboard shortcuts allowing the user to use the app conveniently."},{"icon":"cog","heading":"Customizable Rules","description":"Allowing the user to modify the default rules of Pomodoro Principle to fit on their personal preference."},{"icon":"create","heading":"Built-in Task List","description":"Allowing the user to create tasks they wanted to accomplish and enable them to mark a particular task as done showing some accomplishments."},{"icon":"auto-update","heading":"Auto Updates","description":"With the Automatic Updates feature, it keep the app up to date with the latest updates and enhancements. User no longer have to search for critical updates; it delivers them directly to the computer."}]}}}]}}}